/**
 গ্রিডি অ্যালগরিদম (Greedy Algorithm) হলো প্রোগ্রামিং ও অ্যালগরিদমের একটি জনপ্রিয় ডিজাইন টেকনিক। সহজ ভাষায়, "যেখানে প্রতিটি ধাপে ভবিষ্যতের কথা চিন্তা না করে তাৎক্ষণিকভাবে সবচেয়ে সেরা বা লাভজনক সিদ্ধান্তটি নেওয়া হয়, তাকেই গ্রিডি পদ্ধতি বলে।""Greedy" শব্দের অর্থ লোভী। লোভী মানুষের মতো এই অ্যালগরিদমও সবসময় বর্তমান মুহূর্তের সর্বোচ্চ লাভ (Local Optimum) খোঁজে, যাতে শেষ পর্যন্ত সার্বিক সেরা ফল (Global Optimum) পাওয়া যায়।কীভাবে কাজ করে? (একটি বাস্তব উদাহরণ)মনে করুন, আপনি দোকান থেকে ৩৯ টাকার কেনাকাটা করে দোকানদারকে ১০০ টাকার নোট দিলেন। দোকানদার আপনাকে ৬১ টাকা ফেরত দেবে। সে যদি সর্বনিম্ন সংখ্যক নোট/কয়েন দিয়ে ৬১ টাকা মেটাতে চায়, তবে গ্রিডি পদ্ধতিতে নিচের ধাপগুলো অনুসরণ করবে:ধাপ ১: সবচেয়ে বড় নোট/কয়েন বেছে নেবে যা ৬১ টাকার কম বা সমান $\rightarrow$ ৫০ টাকা। (বাকি থাকে: $৬১ - ৫০ = ১১$ টাকা)ধাপ ২: অবশিষ্ট ১১ টাকার জন্য পরবর্তী বড় নোট/কয়েন বেছে নেবে $\rightarrow$ ১০ টাকা। (বাকি থাকে: $১১ - ১০ = ১$ টাকা)ধাপ ৩: অবশিষ্ট ১ টাকার জন্য পরবর্তী বড় নোট/কয়েন বেছে নেবে $\rightarrow$ ১ টাকা। (বাকি থাকে: $১ - ১ = ০$ টাকা)মোট নোট লাগলো ৩টি (৫০ + ১০ + ১)। এখানে প্রতি ধাপে তাৎক্ষণিকভাবে সবচেয়ে বড় টাকাটি বেছে নেওয়াই হলো গ্রিডি সিদ্ধান্ত।
 */

/**
 * Codeforces 231A
 * Type: Brute force, Greedy Algorithms
 * If rather calling a function multiple times call it once and use the returned valure and save time;
 * input = 1 1 0 = 1+1+0 = 2 means two of them will solve the problme then increase the number.
 */

#include <bits/stdc++.h>
using namespace std;

int main(){
    ios::sync_with_stdio(false); cin.tie(0);

    int tCase;
    int p,v,t;
    int number(0);

    cin>>tCase;
    while(tCase--){
        cin>>p>>v>>t;
        if(p+v+t >= 2) number += 1;
    }
    cout << number << '\n';
    return 0;
}
